{
    "Jesus of Nazareth": ["4 BC - 33 AD", "Most scholars agree he existed in some manner historically.  Galilean Jew traveled around Israel preaching a new radical form of Judaism. Crucified by Pontius Pilate. No matter the validity of his existence, Judaism and the religion surrounding him shaped the Middle Ages.", "https://en.wikipedia.org/wiki/Jesus"], 
    "Diocletianic Persecution": ["303 AD - 313 AD", "Emperors Diocletian, Maximian, Galerius, and Constantius issued a series of edicts rescinding Christians' legal rights and demanding that they comply with traditional religious practices.","https://en.wikipedia.org/wiki/Diocletianic_Persecution"], 
    "Constantine": ["272 AD - 337 AD", "Established Constantinople which would become the Center of Christianity for 1000+ years. Declared the Christian God as his Divine Guardian when he took power. Developed the Edict of Milan ending the persecution of the Christians and Other religions and cults within Rome. Appointed Christians in High Ranking Offices. Helped establish Christian Orthodoxy. Is said to have been Baptised On His Death bed.", "https://en.wikipedia.org/wiki/Constantine_the_Great"],
    "St Augustine Born": ["354 AD", "Aurelius Augustine born in municipium of Thagaste within the province of Numidia in the Roman Empire modern-day Souk Ahras, Algeria.", "https://en.wikipedia.org/wiki/Augustine_of_Hippo"],
    "St Augustine Becomes Bishop of Hippo": ["395 AD", "He became coadjutor Bishop of Hippo and shortly became full Bishop", "https://en.wikipedia.org/wiki/Augustine_of_Hippo"],
    "Sack of Rome Begins": ["410 AD", "Visigoth forces enter Rome, pillage and devastated it, Rome loses all reputation and luster it once had. Augustine would describe these events in his work City of God as necessary to bring Christianity to the 'Barbarians'.", "https://en.wikipedia.org/wiki/Sack_of_Rome_(410)"],
    "St Augustine Dies": ["430 AD","St Augustine becomes Ill and dies in prayer and contemplation. Shortly after his death the Vandals sieged and sacked Hippo, returning later and destroying all but Augustines Library and Cathedral.","https://en.wikipedia.org/wiki/Augustine_of_Hippo"],
    "Rome Falls in The West": ["476 AD", "Following a subsequent severe sack of Rome by Vandals in 455, Rome falls into further disrepair. Vandal leader Flavius Odoacer disposes child Emperor Romulus Augustulus and declares himself King of Italy. Western Roman Empire is no more.", "https://en.wikipedia.org/wiki/Fall_of_the_Western_Roman_Empire"],
    "Pope Gregory I": ["590","Pope Gregory becomes bishop of Rome(aka Pope). He greatly reforms the Church establishing the authority of the office of the pope. Pushes the spread of Christianity and doctrine throughout the western world.","https://en.wikipedia.org/wiki/Pope_Gregory_I"],
    "St Benedict of Nursia" : ["480 AD - 547 AD","Founder of the Benedictine Order, A monastic Order. Monasteries maintained much of western Civilizations throughout what would become known as the Dark Ages. Founded Monte Cassino in 529 AD. Despite the reputation of monasteries being left alone in general, Monte Cassino was destroyed by the Lombards in 581.","https://en.wikipedia.org/wiki/Benedict_of_Nursia"],
    "Cluny Abbey": ["910 AD", "Foundation of Cluny Abbey in Saône-et-Loire, France. It will become a major organizational force for the Catholic Church and help cement the Papacy further.", "https://en.wikipedia.org/wiki/Cluny_Abbey"],
    "Pope Leo IX": ["1049 AD - 1054 AD", "Pushes supremacy of the seat of Rome, cementing papal authority within the church as well as Causing the East-West Schism breaking 'communion' with the Eastern Orthodox seated in Constantinople, the last remnants of the Roman empire.", "https://en.wikipedia.org/wiki/Pope_Leo_IX"],
    "Pope Gregory VII": ["1073 AD - 1085 AD", "Declares papal supremacy over rulers. Ends the investiture controversy declaring bishops to be only assigned by the pope, and enforces clerical celibacy. Henry the IV opposes these decisions and he excommunicates Henry the IV Emperor of the Holy Roman Empire.","https://en.wikipedia.org/wiki/Pope_Gregory_VII"],
    "Pope Urban II": ["1088 AD","The man who declares the First Crusade becomes Pope.","https://en.wikipedia.org/wiki/Pope_Urban_II"],
    "The First Crusades": ["1092","Urban II makes a decree offering remissions of Sins for fighting in a crusade to wrestle control of the East and Jerusalem from the control of the Turks. Mobilizes even Pilgrims who were mostly slaughtered due to a lack of military experience. Successful for a time wrestling back control of Jerusalem.","https://en.wikipedia.org/wiki/First_Crusade"],
    "Hildegard von Bingen": ["1098 AD - 1179 AD", "German Benedictine Abbess. Experienced frequent spiritual visions throughout her life. Wrote her Book of Divine Works at 42, read and approved by Pope Eugene III.","https://en.wikipedia.org/wiki/Hildegard_of_Bingen"],
    "Pope Eugene III": ["1145 AD - 1153 AD","Generally disliked by the people. Held synods reforming clerical life and approving the works of Hildegard.","https://en.wikipedia.org/wiki/Pope_Eugene_III"],
    "Pope Innocent III": ["1198 AD","Innocent the III become Pope, extremely controversial. Brings Franciscans into the church in a time of the church being viewed as greedy, started the 4th Crusade and the Albigensian Crusade.","https://en.wikipedia.org/wiki/Pope_Innocent_III"],
    "Saint Francis of Assisi": ["1181 AD - 1226 AD", "A young man born to a wealthy family. He becomes a devote Christian, eventually betraying his father and choosing to live a life of poverty. Was said to preach to birds. Founds the Franciscan Order.","https://en.wikipedia.org/wiki/Francis_of_Assisi"],
    "The Fourth Crusade": ["1202 AD - 1204 AD","Stated goal to take back Jerusalem, ends in disaster beginning with strife in Constantinople - Alexios The IV disposed of, their payment gone they sack Constantinople for payment ending in complete disaster. The Crusaders won, but Constantinople suffered, those they were said to protect.","https://en.wikipedia.org/wiki/Fourth_Crusade"],
    "Albigensian Crusade": ["1209 AD - 1229 AD","Another Crusade against fellow Christians in the south of France. Meant to eliminate the Cathars. They sack Carcassone.","https://en.wikipedia.org/wiki/Albigensian_Crusade"],
    "Pope Boniface VIII": ["1294 AD - 1303 AD","The Pope of the start of the Babylonian captivity. Political struggle with King Phillip of France during dispute over the idea of French bishops being tried for Treason died in captivity. Papacy 'moved' to Avignon and largely under French control for most of the 14th Century.","https://en.wikipedia.org/wiki/Pope_Boniface_VIII"],
    "Black Death": ["1346 AD - 1353 AD", "Pandemic and Plague swept Europe, killing between 30-60% of the population. Resulted in pogroms, reshaped society, reshaped trade routes.","https://en.wikipedia.org/wiki/Black_Death"],
    "Pope Gregory XI": ["1370 AD - 1378 AD", "Ends the 'Babylonian Captivity', had rival Pope and Bishops in Avignon. Resulted in the Western Schism, 3 Popes by the end of the schism.","https://en.wikipedia.org/wiki/Pope_Gregory_XI"],
    "Jeanne d'Arc": ["1412 AD - 1431 AD","Had visions of Saint Michael and Saint Catalina during the 100 year's war telling her to free the french. Starts living life as a male soldier convinces Charles the VII to allow her to lead the charge on Orleans and is successful, She later leads the charge on Paris and is captured by the English and Burgundians. Taken to stand before the inquisition and burned alive at the stake. Declared a Saint in 1920.","https://en.wikipedia.org/wiki/Joan_of_Arc"],
    "Mehmed II the Conqueror": ["1432 AD - 1481","The man who would make the Byzantine Empire fall.","https://en.wikipedia.org/wiki/Mehmed_the_Conqueror"],
    "Constantine XI Palaiologos": ["1449 AD - 1453 AD", "Last Emperor of the Byzantine Empire.","https://en.wikipedia.org/wiki/Constantine_XI_Palaiologos"],
    "Fall of Constantinople": ["1453 AD","Ottoman Turks siege Constantinople for 53 days lead by Mehmed II, Constantinople falls becoming Istanbul, some would mark this as the \"End of the Medieval Period\"","https://en.wikipedia.org/wiki/Fall_of_Constantinople"],
    "Martin Luther": ["1483 AD - 1546 AD","Would spark the Protestant Reformation with his work the 95 Theses over the sale of indulgences.","https://en.wikipedia.org/wiki/Martin_Luther"]
}